Revit 2027 API
IRebarUpdateServer.GenerateCurves Method
 This function is supposed to calculate the bars in set based on data received in curvesData parameter.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
bool GenerateCurves(
	RebarCurvesData curvesData
)
Function GenerateCurves (
	curvesData As RebarCurvesData
) As Boolean
bool GenerateCurves(
	RebarCurvesData^ curvesData
)
abstract GenerateCurves :
        curvesData : RebarCurvesData -> bool
Parameters
curvesData RebarCurvesData
 Use the members of this class to access the inputs and define the output curves that make up the free form rebar.
Return Value
Boolean
 Returns true if the curve generation was successful, false otherwise.
Remarks
 This function is called in the regeneration context when at least one data in curvesData parameter was changed.
See Also
Reference
IRebarUpdateServer Interface
Autodesk.Revit.DB.Structure Namespace